Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, MAYA'S WORLD.tmx
Source language: id
Languages: en

source: Nggak bisa semua hal lo jadiin buat pelampiasan seneng-seneng lo…
en: for some things, you can't just use them for your own entertainment.

source: Soal yang terjadi selama ini…
en: ...for everything.

source: MAMA
en: mom...

source: Belum pernah
en: He had never

source: What the hell Ras?!!
en: what the hell, laras?!

source: BENAR...
en: was right.

source: DIA YANG SEKARANG.
en: current major.

source: BUAT PELARIAN AJA
en: because

source: Gua udah ngomong jahat sama lu tanpa tau perjuangan lu yang sebenernya demi lepas dari gua.
en: I treated you badly even though I didn’t know the length you had to go through to let me go.

source: penumpang
en: ladies

source: tapi sebelum itu, aku mau ngasih ini ke kamu.
en: but before that, I want to give this to you.

source: ...mereka
en: I’m sure

source: Eh…?
en: huh?

source: CUKUP LAMA.
en: time.

source: NGERTI GIMANA
en: don’t know

source: Ini bukan salah lu juga.
en: this isn’t your fault.

source: RADI
en: you’re

source: APA-APANYA
en: is nothing

source: kalo gitu... kenapa ibu nawarin saya jadi tim proyek penelitian dosen?
en: if that’s the case, then why did you choose me to participate in this research project?

source: BETAPA KECEWANYA
en: in

source: MINTA MBAK
en: them to

source: saya nggak tau sih mau bahas apa, kayaknya harus semedi yang lama di perpus.
en: my new thesis topic is still up in the air. I guess I should go to the library to meditate.

source: MAMA MAU
en: when we went to

source: BAHKAN KELAR KULIAH PUN, KAMI LEWATIN PINTU YANG BERBEDA.
en: even after class is over, we leave through different gates.

source: Bokap pasti udah merintah semua suruhannya buat nyari gue, tapi seenggaknya mereka bakal buang-buang waktu nyariin gue ke seluruh Bandung 'kan?
en: dad must’ve already sent his lackeys to look for me. but they’d waste their time flipping over every stone in bandung just to find me.

source: TOLONG KASIH
en: some

source: DIA SAMPAI
en: after

source: SIDANG PUN...
en: thesis defense...

source: MA...
en: about that...

source: KENAIKAN KELAS,
en: my exams,

source: KAK LARAS LIHAT MASBIN NGGAK?!!!
en: have you seen bintang?!

source: Lagian mama mau bikinin buat sekeluarga, jadi harus dipikirin sekarang.
en: besides, I’m planning to make them for the whole family. so, we gotta do it as soon as possible.

source: O-OOH...
en: oh?

source: Mama penasaran.
en: I’m kinda intrigued.

source: 1% studi webtoon series
en: 1% studio webtoon series

source: Maafkan kelalaian kami!
en: s-sorry for the trouble!

source: MASA GUA
en: I tried

source: AKU KALO
en: how to operate

source: Aku sadar aku selama ini maksain semuanya ke kamu.
en: I know that I’ve always put too much on your plate.

source: DIBIARKAN, TUAN.
en: about this, sir.

source: Yang jelas mama harus lihat saya bersungguh-sungguh untuk membuktikan diri saya bisa.
en: I need to prove myself and show her that I can do it.

source: suka bermain
en: to play

source: kelilipan?
en: is she tearing up?

source: KATAIN BAU
en: to tease him,

source: SORI, GUA
en: sorry,

source: SAYA HARUS BERES-BERES.
en: I need to get moving quickly.

source: ORANG
en: mr. ipin

source: TEMENIN.
en: for a bit.

source: APA PUN GITU...
en: or whatnot.

source: MAH MASIH
en: to Japan

source: KARENA
en: well,

source: Maya, ayo pilih kamu mau yang mana nak!
en: maya, are there any clothes that catch your eye?

source: TERUS KARENA
en: on my plate

source: CLEAR.
en: clear now.

source: DORONGAN
en: my personal

source: loh kamu kenapa?
en: hey, are you okay?

source: KAPAN TAU
en: so

source: Gue nggak ngerti… apakah lo harus sampai kayak gitu ke gue, Rad?
en: I don’t get it, radi. do you really have to do this to me?

source: ANEH JUGA SIH NYERITAIN INI KE KAMU… TAPI… GAK APA-APA DEH HAHAHAHA!
en: it would be awkward to tell you this, wouldn’t it? well, whatever, I’ll tell you anyway, haha!

source: MAAF YA… KAK AIS SELALU NGGAK SEMPET BILANG GSAMA MAYA SOAL INI…
en: I’m sorry... that I didn’t tell you this sooner.

source: KITA MULAI
en: begin by doing

source: Mama penasaran, yang punya toko masih inget mama nggak yaaa?
en: I wonder if the owner still remembers me, hahaha.

source: SORI… GUE CUMA KEPIKIRAN SOAL GIMANA LO BISA KETEMU RADI…
en: sorry... I was just wondering how you ran into radi.

source: CERITA SAMA
en: told me

source: SAYA EMANG SEMPAT SEBEL SAMA KAMU.
en: you did annoy me.

source: SAYA, APA YANG
en: what happened to you

source: TAPI IBU YAKIN,
en: however,

source: DIMANA NAK?
en: but where?

source: IYA JAUH,
en: that’s so cool!

source: Siapa sih dia?
en: who’s he?

source: WAKTU MAMA
en: I was

source: …DIA KENAPA LAGI SIH…
en: what’s wrong with him?

source: HAHA...
en: hahaha...

source: UDAH GAPTEK
en: this machine,

source: bintang...! tunggu, ini kenapa sih tiba-tiba...?
en: bintang, wait! What are you trying to say?!

source: LO PUTUS
en: did you break up

source: PENASARAN DAN
en: that you really want to analyze

source: haduhh... tas ini kok gak dicuci sih...
en: tsk... this bag is so dirty...

source: KAK AIS DULUAN
en: can go without me.

source: Ayo membuat
en: They decided to

source: Tapi basi banget nggak sih ceritain ginian, lo udah tau juga 'kan gimana keluarga kita?
en: bleh... I shouldn’t have you told you this. hahaha! you already know about my family.

source: APA EMANG
en: is this what

source: COCOK CUMA KEJAUHAN,
en: but it’s a bit far from home.

source: SAYA SEDANG INGIN MENGENALI DIRI SAYA SENDIRI AGAR KELAK… KETIKA SAYA INGIN MEMUTUSKAN UNTUK UNTUK BERPACARAN LAGI…
en: I’m trying to learn more about myself so that when I’m ready to date someone, I’ll be better prepared...

source: KE PASAR BARU,
en: about this

source: kamu ngapain balik ke surabaya?! kan belom libur kuliah?!
en: what are you doing in surabaya?! this semester break hasn’t even begun yet!

source: ORANG-ORANG
en: to meet people

source: Ya udah…
en: then so be it.

source: SEMUA TAPI
en: I just need

source: KITA NGGAK
en: w-we

source: DESAIN
en: DESIGN

source: SATU TAHUN ITU CUMA SEBENTAR.
en: one year is not that long.

source: SAYA NGGAK
en: because

source: PAKET LENGKAP
en: the details

source: oh iya... ini abis tugas studio semua selesai mau diurus kok ma.
en: oh, yeah, I’m going to finish it once I’m done with the project.

source: GUE ANGKAT...
en: should I pick it up?!

source: APA DI TUGAS AKHIR
en: of your

source: KAMU INI
en: so...

source: CILOR GUE
en: them,

source: SENDIRI...
en: all by myself...

source: LIBUR KAYAKNYA
en: not until

source: GUE NGEJAR
en: chasing

source: BERBAGAI CARA
en: he best

source: Jika ini memang satu-satunya cara, maka sebaiknya kita kayak gini aja.
en: if it has to be this way, then I think it’s for the best.

source: MAKASIH UDAH MAU DITITIPIN TEMEN GUE…
en: thanks for letting my friend stay here.

source: SAYA TINGGAL,
en: I completely disregarded

source: Sekarang kebaya wisudaan itu macem-macem, jadi Maya coba pilih mau cobain yang kayak apa?
en: nowadays, graduates wear a wide variety of blouses. so tell me, what kind of blouses catch your eye?

source: IDE BAGUS
en: wouldn’t it be

source: Ah udahlah, gue nggak mau kita berdebat lagi.
en: argh, screw it! I’ve got no time to argue with you.

source: DHUAGH
en: whack

source: *tatap*
en: *stare*

source: DIA LAGI…
en: man... it’s him again.

source: DISINGGUNG
en: in each of

source: NAMPAKNYA
en: she

source: Argo Parahyangan
en: the train

source: JAKARTA?
en: in jakarta?

source: NGGAK ASIK YA?!
en: you don’t find it exciting, eh?!

source: episode 66 Menemukan Keinginan
en: episode 66 find what I want

source: ZREG!
en: stand

source: LANGSUNG SAMA
en: have the opportunity

source: Maya adalah orang yang selalu blak-blakan ngasih tau orang macam apa gua, dan selalu terus terang soal kekurangan gua, hal yang selalu gua lakukan ke orang lain, tapi nggak ke diri gua sendiri.
en: maya was very straightforward with me. she had no hesitation about describing what kind of person I was. she never hesitated to point out my flaws. I always did these things to others, but not to myself.

source: KENAPA TAKUT?
en: why?

source: ANAK ORANG
en: a snotty

source: WAKTU KITA
en: we were confronted,

source: MEMANGNYA RADI MERENCANAKAN INTERNSHIPNYA DADAKAN?
en: did he really not have time to tell me about his internship?

source: AH...
en: oh...

source: NGANTERIN MAMA
en: take mom

source: Udah mama duga kamu pasti milih yang itu.
en: I knew you’d pick that one.

source: NIH BACA-BACA
en: oh, well...

source: SEBENERNYA SELALU
en: isn’t something new.

source: GUE ABIS INI
en: I should

source: INI PAKENYA GIMANA DAH?!
en: how do we operate this thing?

source: proyek penelitian dosen ini salah satu kesempatan buat kamu untuk lebih terbiasa bekerja dengan orang lain.
en: this research project would be an opportunity for you to collaborate with others.

source: BUKU AJA, AKAN
en: from journals,

source: lah itu depan mata lo apaan?!
en: you’re looking at it right now!

source: YANG LAIN AJA
en: talk about

source: LAH YA...?
en: right?

source: IYA GAK APA-APA, KASIH TAU SAYA KALO KAMU UDAH TENANG.
en: no worries, just let me know when you feel better.

source: TAPI KITA MALAH MENGABAIKAN BAHWA UNTUK SALING MELENGKAPI, BUKAN BERARTI KITA NGGAK MENJADI YANG TERBAIK UNTUK DIRI KITA.
en: but there’s one thing we often forget. just because a couple completes each other, it doesn’t mean we don’t need to be our best selves.

source: UDAH MULAI
en: is the

source: NGGAK BISA
en: pressure her

source: KE APARTEMEN.
en: to my apartment.

source: …Soalnya saya penasaran, karena terlalu banyak praktek, saya pengen tau lebih banyak aja secara tulisan…
en: I was curious. I wanted to know the theories too so I could apply it when I practiced.

source: APA IYA GUE BENER-BENER DILACAK?!!
en: so... am I really being tapped?

source: RADI.
en: him.

source: tapi kesepian
en: Well, nice and lonely...

source: PALING
en: maybe he was

source: KE MELBOURNE,
en: in a few days.

source: KAMU BILANG TADI UDAH LAMA NGGAK KETEMU DOSBING, KAMU KABUR DARI T.A…?
en: You said that you haven’t talked to your advisor lately. are you trying to avoid your final project?

source: KOSONG.
en: empty.

source: SILAKAN.
en: well, go ahead.

source: MUARANYA DARI GUE...?
en: who caused all of this?

source: Bikin masalah aja deh…
en: tsk... you’re so troublesome.

source: Gue gak apa-apa kok gue aja yang nyetir…
en: I’m okay! let me drive.

source: CERAI?
en: divorced?

source: TUGAS AKHIR
en: I’m sure your thesis

source: Apakah perasaan gue ke lo masih sama?
en: are my feelings for you still the same?

source: Berani?
en: when there’s a lot of animals!”

source: maya, kok nggak bilang mau pulang? ‘kan kak ais bisa jemput?
en: oh, you’re home already? why didn’t you ask me to pick you up?

source: BRAK
en: clack

source: JADI SELAMA
en: so, all this time,

source: BERES.
en: all done!

source: JADI INTINYA ANAKNYA LAGI SUSAH DIHUBUNGI AJA…
en: so, it seems like he doesn’t want anyone to reach out to him right now.

source: Atau lanjut…?
en: are we done?

source: RADI UDAH TENANG?
en: are you feeling better now?

source: KOK KAYAKNYA BAGUS…?
en: it looks interesting.

source: KAMU BISA BAHAS
en: I’m sure you’ll write

source: PANJANG
en: a long

source: MAMAAA!!!!
en: mom!

source: ADA KUNJUNGAN IBU PEJABAT NIH…!!!
en: look who’s coming. woman of the hour!

source: MAIN CABUT NGGAK JELAS KAYAK GITU, ANEH BANGET DEH…
en: he just left for no reason, what a weirdo...

source: Taman Panatayuda
en: Panatayuda Park

source: SAYA NYARIIN KAMU DARI TADI!!
en: I’ve been looking for you, you know!

source: APA SIH?!!!
en: too much!

source: SAMA ANAKKU YA,
en: my daughter.

source: IBU DARITADI
en: in the restroom

source: TAPI KEREN
en: good

source: BOLEH...
en: but, you still

source: TAU SIH ASAL-USULNYA
en: who started it.

source: BAKAL NAMBAH-
en: only make

source: I-ya Pak!
en: y-yes, sir!

source: BAWEL!!!
en: shut up!

source: MAU BALIKIN
en: to return this

source: YAUDAH
en: I’ll stay

source: MAU DI APARTEMEN
en: you like

source: yah... awalnya sulit saya terima sih... saya mengalami perseteruan batin...
en: well... at first, I was devastated to find out the truth. I felt as if I was at a crossroads.

source: HAH...
en: I guess

source: DI SITU AJA...
en: in the studio.

source: …Mama lagi kenapa sih… kok… aneh banget…
en: what’s up with her? she’s been acting weird lately...

source: JADI TOLONG NGGAK USAH IKUT MERASA BERTANGGUNGJAWAB SAMA MASALAH GUE…
en: so, please don’t feel responsible for my problem when you already have a lot on your plate.

source: AH ITU
en: oh,

source: JAM BERAPA?
en: depart?

source: AKU KAYAK KEHILANGAN FUNGSIKU.
en: ...life has become meaningless to me.

source: SAMA SATU
en: on one

source: DIA SUKA NOLONGIN
en: how he always

source: Radi bisa aja gagal berangkat ke Jepang gara-gara lo…
en: because of what you did, radi’s trip to Japan almost got canceled.

source: BOLEH
en: I can

source: BARUSAN NANYA HAL
en: have asked you

source: Tin!
en: honk

source: ini juga talinya udah mau lepas, kenapa masih dipakai sih, nak?
en: the strap is about to break too... isn’t it time for you to get a new one, maya?

source: RADI TUH KAYAK
en: he’s always been

source: NGGAK NGERJAIN
en: she didn’t want

source: PUNYA TEMPAT
en: I could have a place

source: OBAT.
en: your meds.

source: kamu kenapa jalannya lambat banget, kasian yang di belakang lagi buru-buru.
en: hey, pick up the pace, will you? you’re holding me up. I’m in a rush, you know?

source: Berkat
en: Thanks to

source: MULAI NYARI
en: I need

source: DUDUK KOSONG.
en: seats.

source: KENAPA DIA GAK CERITA SAMA SAYA?
en: why didn’t he tell me about it?

source: episode 63 Juga Alasan Yang Harus Didengar
en: episode 63 a reason that must be known

source: IYA...
en: well,

source: SKRIPSINYA
en: her

source: DARI AWAL KETEMU WAKTU NYERAHIN KERAMIK UDAH PENGEN NANYAIN… CUMA…
en: I was going to ask her that when I brought in my ceramics, but...

source: BUKU INI JADI
en: like it was

source: JANGAN KAYAK GITU, BENTAR LAGI KAMU LULUS LOH!!!
en: keep your chin up. you’re about to graduate, you know!!!

source: SEMOGA YANG DATENG ITU BINTANG…
en: I hope it’s bintang...

source: Gue… nggak pernah dikasih kesempatan buat minta penjelasan dari lo, lo tiba-tiba ilang, menganggap gue orang asing.
en: you never explained anything to me. instead, you simply disappeared, as if I didn’t exist.

source: DIA UDAH
en: she had

source: UDAH JAUH BANGET
en: there was a rift

source: TAPI DARI AWAL
en: but...

source: haha... bener sih...
en: haha... you’re right.

source: BUKA MULAI JAM
en: open from

source: REFERENSI DARI
en: look for some references

source: KEMAREN DIA NELPON GUE… PAKE UNKNOWN NUMBER… GUE DIJEBAK
en: the other day, he tried to trick me by calling me from an unknown number.

source: GUE JATOH!
en: I fell down!

source: Oooh… tapi sekarang udah selesai 'kan kuliahnya?
en: ah... but you’ve finished the course, right?

source: SEMUA ORANG SIBUK, PUNYA TUJUAN...
en: and everyone was too busy...

source: BOLEH NGGAK?
en: something else?

source: episode 61 Bersama Rasa Yang Pelik
en: episode 61 a bitter feeling

source: KAMU YA?!
en: your thesis?!

source: YAH...
en: well...

source: TAPI GUE ENGGAK.
en: but I wasn’t one of them.

source: KAMPUNG!
en: punks!

source: Ciak pikir
en: The chick

source: tap tap tap
en: step step step

source: SIH MINTA DIA
en: to open up

source: DIA MELAKUKAN
en: she’s been doing

source: TAPI AKHIR-AKHIR INI DAH JARANG BALESIN, KAYAKNYA LAGI SIBUK NGURUSIN KEHILANGAN DANLAIN-LAINNYA.
en: but lately, he hasn’t really replied to our messages. maybe he’s been busy with filling out the police report for his lost phone.

source: DADAH!
en: see you!

source: KARYANYA.
en: as soon as possible.

source: BERJARAK SAMA
en: distancing himself

source: JUGA?!
en: right!

source: aku juga butuh waktu buat diriku sendiri sekarang.
en: I also need some time for myself.

source: APA-APA DEH
en: between them.

source: GIMANA AKU YANG TERUS-TERUSAN MELINDUNGI DIA DARI MASALAHNYA DAN RADI, BUKAN MENDORONGNYA BUAT MENGHADAPI MASALAHNYA.
en: back then, I’d been protecting laras from radi instead of urging her to face her problems.

source: maya, ibu nggak bisa nerima skripsi ini.
en: maya, I can’t approve your thesis.

source: serigala
en: the lonely

source: ORANG, GERCEP URUSAN
en: helps others,

source: Kalo bisa jangan lama-lama, Neng Ayu butuh istirahat.
en: please don’t take too long, okay? she needs to rest.

source: KITA HAMPIR
en: we’ve been

source: Oh atau mau yang kayak baju Bali itu?
en: oh, maybe you can wear a traditional balinese blouse, maya!

source: ANAK IBU, HAHAHA.
en: as your daughter, hahaha...

source: RAMBUT LO KENAPA?
en: what’s with your hair?

source: BANTUIN GAWE ATAU
en: whether work-related

source: Sampai gue mencari cara gimana caranya agar lo mau liat gue lagi.
en: then, I tried to find a way to make you look at me again.

source: TAPI KARENA
en: I picked it

source: YA UDAH, IKUT GUE NYARI RADI YUK KALO GITU.
en: you know what, let’s find radi together.

source: kata masbin semangat kelayakannya, dia minta maaf nggak bisa dateng...
en: he wishes you luck on your exam. he was sorry he won’t be able to come tomorrow.

source: AYU TERIMA SEJAK
en: after you and dad

source: YA...
en: right?!

source: MAYA 'KAN?
en: forget?

source: DARI SEKOLAH INI.
en: I’d be done with this school.

source: Iya, saya bakal fokus sripsi.
en: yes, I’ll focus on my thesis.

source: SRAK!
en: RUSTLE

source: MENYARANKAN
en: there’s no need

source: lha kamu pulang ndadak se... wes kamu pindah o ndek kamar e adekmu!!
en: you should’ve told me that you were coming home. just use your brother’s room for now.

source: gmn
en: what do

source: LAIN-LAINNYA...
en: such...

source: SAYA
en: train

source: TRUS SAYA
en: so, I decided

source: SIBUK SAMA URUSAN
en: that you’re always busy,

source: DEH!
en: later!

source: KAK AIS MAU KE TEMPAT LAUNDRY DULU YAAA!
en: I’m going to do the laundry!

source: SUSAH...
en: it would be...

source: Siapa ya?
en: who’s this?

source: Kalo gitu mau nyari bareng nggak?
en: I see... shall we go and find him together?

source: OMELIN AJA,
en: don’t hesitate to tell her off,

source: SIUN BA
en: tion band

source: JAMES usil dan
en: that James

source: undangan Ciak
en: the chick’s invitations,

source: MASALAH ITU.
en: to handle them.

source: TAKUT…?
en: “afraid”?

source: AKU BENTAR LAGI KE BAWAH!
en: I’ll be there in a second!

source: maksud kamu apa, bin?
en: what do you mean?

source: KARYANYA TUH,
en: already? tsk...

source: SAMA ANAKKU, DIA
en: the same age with my daughter.

source: kalau saja saya menyadari semuanya dari awal
en: if only I had realized this from the beginning...

source: YA, DAN!
en: jordan!

source: hah....?
en: what?

source: MASA RADI
en: I mean...

source: Udah ah gue susul aja!!
en: enough chit-chat, I’ll just go there!

source: SKRIPSI.
en: her thesis.

source: YAUDAH.
en: fine,

source: GUE TADI DI BAWAH NANYAIN ANAK-ANAK LAIN SOAL RADI.
en: I’ve already asked the guys about radi.

source: Nggak ada sih, ngobrol aja, sebelum menghadap tuan besaaar!
en: huh? I just want to talk before I’ve got to deal with my big boss dad.

source: TAPI KEJADIAN INI KENAPA NYEBELIN BANGET?!!!
en: but why this is so annoying to me?!

source: GUE CUMA MENIKMATI SISA-SISA PERBUATAN
en: I was too busy dealing with the repercussions

source: EMANG NGGAK
en: I haven’t told you

source: Yaaah!
en: oh, well!

source: KAYAKNYA NGGAK YA?
en: I don’t think you do, huh?

source: DEH BU SAYA
en: with you

source: ...LARAS...?
en: l-laras?

source: DULUAN
en: have to go

source: BILANG KAMU
en: that your thesis defense

source: Oh iya, kakakmu bilang kamu ngambil keramik pilihan ya?
en: oh, right, your brother mentioned that you took a ceramic course.

source: PESTA
en: throw a party.

source: semua yang kamu bahas jadi nggak mendalam.
en: Your analysis is too broad.

source: LAGI YA, SAYA
en: it up? I thought

source: tapi kayak gini tuh maksudnya gimana, maya...?
en: but what did you mean by “this way,” maya?

source: BAWA
en: did you

source: DI SISI LAIN AKU LEGA LARAS BISA MENANGANI MASALAHNYA TANPA BANTUANKU
en: I’m glad that laras can now handle her problems on her own.

source: BUAT JAGAIN
en: take care

source: CINTA GITU
en: did his girlfriend

source: SAYA NEMU TEMPAT YANG
en: for me. I’ve found one,

source: Gue cuma pengen…
en: I just want us...

source: Oooh… Mau jenguk ya?
en: I see. so you’ve come here to visit her, huh?

source: GUE YANG
en: you were

source: Berarti lo masih bisa baikan sama Maya 'kan?
en: so... you can still get back together with her, right?

source: justru skripsi sebelumnya malah jauh dari ini skripsi saya!
en: in fact, I thought my previous thesis diverged significantly from my intended hypothesis!

source: NGASIH IMBALAN?
en: you losers?

source: INI GUA LAGI
en: I’m at

source: Tep!
en: step

source: Ngapain aja sih kuliahnya?
en: what did you learn?

source: PASTI GEDE-GEDE KAN KAYAK PATUNG DI LAPANGAN ITU?!
en: it must be as large as the field’s sculptures!

source: INI LO
en: are you flying

source: XII IPS-1
en: social science 3-1

source: Nggak gue nggak liat dan gue juga nyari Radi.
en: no, I haven’t. I’ve been looking for him too.

source: YANG BIKIN, JADI PADA
en: I guess we shouldn’t have

source: Yaudah terserah!!
en: fine, then!

source: Oh, mau yang ini?
en: oh, you want this one?

source: Eh tapi… katanya saya juga harus ganti dosbing…?
en: oh, wait... I’ve just realized that I need to switch advisors!

source: KALO NGGAK
en: if you don’t pick it up,

source: MAU NOLONGIN
en: if you don’t mind,

source: DIAMBIL, DIPAJANG
en: put it

source: RADI JADI LEBIH MEMILIH NGURUSIN SAYA KETIMBANG MASALAHNYA SENDIRI.
en: because of that, radi had to take care of me instead of his own problems.

source: DULU, ABIS
en: eat this. after this,

source: MENURUT SAYA
en: I thought

source: Maya suka yang ini…
en: I like this one...

source: Kenapa nggak ngabarin dulu mau ke sini?!!
en: what are you doing here?!

source: KULIAH SETAHUN,
en: a year.

source: SIAPA PUN KALO
en: that you boys

source: Nggak usah panggil nama lengkap!!
en: stop calling me by my full name,

source: BERURUSAN
en: be dealing

source: MAU PULANG DULU
en: I'm about to

source: Dengan menyelamatkan hubungan lo dan Maya yang udah gue rusak…
en: ...is to fix your relationship with maya.

source: maya, kamu suka nggak ngerjain topik skripsi ini? karena ibu nggak liat semangat kamu di skripsi ini.
en: are you interested in this topic or not, maya? because I get the impression you're not particularly enthusiastic about this.

source: YAUDAH GAK USAH SEWOT GITU JAWABNYA…
en: hey, what’s your problem?

source: AH YA… KITA KOMUNIKASI PAKE EMAIL SAMA DM TWOTTER SIH, RAS…
en: oh, we’ve been in touch with him through email and twitter private message.

source: aku sengaja ke surabaya, buat mencegah diriku sendiri biar gak berlagak pahlawan lagi buat kamu.
en: and I’ve made my way here to keep myself from pursuing you. I’m done being the hero.

source: DI PENULISAN INI ADA CORETAN DOSEN LO BILANG,
en: your advisor has included a message in this section.

source: KAMU SENDIRI
en: in your own

source: DILABRAK, YANG
en: the only person

source: Cerita ini adalah fiktif belaka, jika ada kesamaan nama tokoh, tempat kejadian, ataupun cerita, itu adalah kebetulan semata dan tidak ada unsur kesengajaan.
en: This is a work of fiction. Any similarity to actual persons, living or dead, or actual events, is purely coincidental.

source: Balikin mantel aku doooong!
en: I’m here for my coat!

source: Yang ini bahannya bagus ya, nak?
en: how about this one, maya? I think it’s pretty good!
